module.exports = (req, res, list) => {
  //หากไม่มีข้อมูล
  if (!req.body) {
    //แจ้งสถานะ 400 ข้อความร้องขอที่ส่งมามีความผิดพลาดทางไวยากรณ์ หรือไม่สามารถทำตามการร้องขอนั้นได้
    res.status(400).send({
      message: 'ไม่พบข้อมูลที่ส่งมา!',
    })
    return true
  } else if (list) {
    //เช็คแต่ละอันว่ามีข้อมูลหรือไม่
    for (const key in list) {
      if (!list[key]) {
        //แจ้งสถานะ 400 ข้อความร้องขอที่ส่งมามีความผิดพลาดทางไวยากรณ์ หรือไม่สามารถทำตามการร้องขอนั้นได้
        res.status(400).send({
          message: 'มีข้อมูลบางส่วนห้ามเป็นค่าว่าง',
        })
        return true
      }
    }
  }
}
